app/Controllers/Film.php

    public function destroy($id)
    {
        $this->film->delete($id);
---
DELETE FROM `film`
WHERE `id` IN ('10')

            'duration' => $this->request->getPost('duration'),
            'cover' => $imageName,
        ];
        $this->film->save($data);
---
INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('New Filmm', '2', ' 2 jam 22 menit', '1688345709_11c2afe3e23ed70c20d9.jpg')

            return redirect()->back()->withInput()->with('errors', $errors);
        }
        // ambil data lama
        $film = $this->film->find($this->request->getPost('id'));
---
SELECT *
FROM `film`
WHERE `film`.`id` = '2'

            $data['cover'] = $imageName;
        }

        $this->film->save($data);
---
UPDATE `film` SET `nama_film` = 'Adagiumm', `id_genre` = '10', `duration` = '1 Jam 20 Menit'
WHERE `film`.`id` IN ('2')